{"config": {"name": "model_1", "output_layers": [["dense_4", 0, 0]], "layers": [{"name": "input_1", "config": {"input_dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 80, 160, 3]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "convolution2d_1", "config": {"name": "convolution2d_1", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "bias": true, "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 24}, "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D"}, {"name": "elu_1", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "ELU"}, {"name": "convolution2d_2", "config": {"name": "convolution2d_2", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "bias": true, "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 36}, "inbound_nodes": [[["elu_1", 0, 0]]], "class_name": "Convolution2D"}, {"name": "elu_2", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "ELU"}, {"name": "convolution2d_3", "config": {"name": "convolution2d_3", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "bias": true, "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 48}, "inbound_nodes": [[["elu_2", 0, 0]]], "class_name": "Convolution2D"}, {"name": "elu_3", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "ELU"}, {"name": "convolution2d_4", "config": {"name": "convolution2d_4", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "bias": true, "activity_regularizer": null, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 64}, "inbound_nodes": [[["elu_3", 0, 0]]], "class_name": "Convolution2D"}, {"name": "elu_4", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "ELU"}, {"name": "convolution2d_5", "config": {"name": "convolution2d_5", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "bias": true, "activity_regularizer": null, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 64}, "inbound_nodes": [[["elu_4", 0, 0]]], "class_name": "Convolution2D"}, {"name": "elu_5", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "ELU"}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["elu_5", 0, 0]]], "class_name": "Flatten"}, {"name": "dense_1", "config": {"name": "dense_1", "activation": "linear", "output_dim": 100, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 2496, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dense"}, {"name": "elu_6", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "ELU"}, {"name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "inbound_nodes": [[["elu_6", 0, 0]]], "class_name": "Dropout"}, {"name": "dense_2", "config": {"name": "dense_2", "activation": "linear", "output_dim": 50, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 100, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Dense"}, {"name": "elu_7", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["dense_2", 0, 0]]], "class_name": "ELU"}, {"name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "inbound_nodes": [[["elu_7", 0, 0]]], "class_name": "Dropout"}, {"name": "dense_3", "config": {"name": "dense_3", "activation": "linear", "output_dim": 10, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 50, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Dense"}, {"name": "elu_8", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["dense_3", 0, 0]]], "class_name": "ELU"}, {"name": "dense_4", "config": {"name": "dense_4", "activation": "linear", "output_dim": 3, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 10, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null}, "inbound_nodes": [[["elu_8", 0, 0]]], "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]]}, "keras_version": "1.2.1", "class_name": "Model"}